{
    "rules_of_inheritance": "Rules of Inheritance",
    "rule_1": "When a Muslim passes away, the amount/property/estate is inheritable after:\n\n1. Paying for the expenses of the funeral\n\n2. Returning of debts\n\n3. Giving away the will (which cannot be more than 1/3 of the amount/property/ estate)\n\nNote: Will can't be written after the legal heirs which are already receiving shares in inheritance. After the paying above, the remaining property will be eligible for inheritance as per below-mentioned shares:",
    "husband": "1. Husband:\n\n(i) The husband gets 1/2 if no child/ children is/are present\n\n(ii) The husband gets 1/4 if child/children is/are present",
    "widow": "2. Widow:\n\n(1) The widow gets 1/4 if no child/children\n\n(2) The widow gets 1/8 if child/children is/ are present\n\n(3) If more than one wife/widow, all the widows share equally out of the 1/4 or 1/8 share.",
    "father": "3. Father (of the deceased):\n\n(1) Father without child/children is treated as Residuary i.e. after giving shares to the Quranic heirs will get the residue.\n\n(2) If the child/children of the deceased exist then the father will get 1/6.",
    "mother": "4. Mother (of the deceased):\n\n(1) The share of mother is 1/3 in the ABSENCE of child/children or two brothers or two sisters or 1 brother and 1 sister.\n\n(3) If the mother is with father and the widow/wife (or husband) is also present, the mother will get 1/3 of what remains after deducting the share of spouse (wife/ wives or husband).",
    "daughter": "5. Daughter:\n\n(1) The share of single i.e. one daughter is 1/2.\n\n(2) If the daughters are more than one i.e. two or more, the share is 2/3 to be divided equally among them.\n\n(3) If the son is also present with the daughter. The daughter will inherit as Residuary. Two parts will go to the son and one part to the daughter.",
    "full_sister": "6. Full Sister (Sister from Same Mother and Same Father)\n\n(1) A full sister will not get the share in inheritance in the presence of:\n\n(a) Child/Children, or\n\n(b) Child/Children of son, or\n\n(c) Father, or\n\n(d) Father's father.\n\n(2) If the sister is one, she will get 1/2.\n\n(3) If the sister is more than one i.e. two or more full sisters, they will get 2/3.\n\n(4) If the bother exists along with sister, she inherits as Residuary (with two shares going to the brother(s) and one share to the sister).",
    "law_of_increase": "7. Law of Increase (Aul):\n\nAfter all the shares are distributed and the sum total exceeds one, the law of increase (Aul) is applied.\n\nFor example, if the sum of the shares is 15/12 then, 15 represents the number of shares and 12 represents fragments or pieces of the property. In such a scenario, the shares exceed the number of fragments of property.\n\nThe sum total must be equal to one and, secondly, the respective shares of the Sharers cannot be changed because they are specified in the Quran. Therefore, for making the aggregate unity without changing the respective shares, the fragments of the property are increased by adopting the following method:\n\nDont change the numerator, the denominator will be increased so that it becomes equal to the numerator (total number of shares). With this method, the aggregate of the shares is made equal to one.\n\nFor example, if the sum is 15/12, we find that denominator is 3 less than the numerator therefore, by adding three to the denominator (12+3) it becomes 15 i.e. equal to the numerator.\n\nExample:\n\nA deceased dies leaving her (a) husband, and (b) two full sisters. The normal shares are:\n\nHusband 1/2 (Sharer)\n\nTwo full sisters 2/3 (Sharer)\n\nHere, the sum total of the shares is not equal to one, it is (1/2 * 2 / 3) = 7/6 which is greater than unity. Thus the aggregate of the shares of husband and two full sisters may be given as under:\n\n3+4\n\n1/2 + 2/3 = z = 7/66\n\nOr, 3/6 + 4/6 = 7/6\n\nSo by applying the law of increase, one is added to the denominator so it will become (6+1) = 7. Thus, we have increased the number of fragments of property without altering the shares. Now, taking this increased denominator (i.e. 7) as the common denominator, we may allot the\n\nHusband 3/7\n\nTwo full sisters 4/7",
    "law_of_return": "8. Law of Return (Radd):\n\nWhen the sum of shares is less than one, the law of return (radd) is applied.\n\nWhen the sum of total shares is less than one, it implies that the number of shares is less than the number of pieces of property. For example, the sum of all the shares is 5/12, meaning by that the shares are 5 whereas the pieces of property are 12.\n\nThe remaining is added according to the following manner:\n\n(1) The sum total was 5/12, so the residue will be (1 - 5/12) i.e. 7/12. 7/12 is supposed to be added for example to the share of father and sisters in the proportion of their own shares i.e. in the ratio of 1/6 and 1/2 respectively.\n\n(2) The law of Radd is not applicable to the husband and widow. The remaining amount returns to all the heirs except the husband or widow. However, if the widow (or husband) is the only heir left they will inherit the whole property.\n\nThe Method:\n\nThe remaining share will be added (except husband or widow) in the same ratio as their own shares:\n\n(a) Give all the shares to the legal heirs.\n\n(b) If the spouse (husband/wife) exist, his (or her) share is left apart. There share will not be altered as per the law of radd.\n\n(c) After deducting the share of the spouse. E.g., if daughter and mother are left, their shares are 1/6 and 1/2 respectively. Their ratio is 3:1, if the property is 4, the daughter's share will be 3/4, and the mother's share will be 1/4.\n\n(e) For example, after deducting the share of widow (1/8) the remainder is (1-1/8) = 7/8. The remaining will be distributed between the daughter and mother in the ratio of 3:1. The shares of the daughter and mother will be 3/4 of 7/8 and 1/4 of 7/8 respectively.\n\nExample:\n\nThe deceased leaves behind her (a) husband and (b) mother. The property will be inherited as such:\n\nHusband 1/2 (Sharer)\n\nMother 1/3 (Sharer)\n\nThe total shares are 1/2 + 1/3 = 5/6, whereas, the property to be distributed is one. The remaining amount is (1-5/6) i.e. 1/6. The remaining would return back to the heirs.\n\nBut, the spouse will not get back the remaining. In this case, the mother will get the remaining property/amount. Thus, the share of the mother is 1/3 + 1/6 = 1/2.\n\nHusband 1/2 (Sharer)\n\nMother 1/2 (1/3 as Sharer + 1/6 in return)",
    "residuaries": "9. Residuaries:\n\nWhen the deceased has no Sharers present, the property will be inherited by the Residuaries. Secondly, after distribution of the property, a residue remains and the residuary exists, the residue will go to the Residuaries.\n\nIt some cases the Sharers will become the Residuaries e.g., a daughter with son, sister together with brother. The father without children (of the propositus) will become the Residuary.\n\nThe list of Residuaries is as below:\n\nDescendants:\n\na. Son:\n\n(i) when the daughter does exist the son takes the entire residue.\n\n(ii) when son and daughter both exist, the son gets double the share of a daughter.\n\nAscendants:\n\nb. Father:\n\nThe whole residue will go to the father.\n\nCollaterals: Descendants of Father:\n\nc. Full Brother:\n\n(i) If the sister does not exist, the full brother inherits the entire residue.\n\n(ii) If the sister exists along with the brother, the full brother inherits with her but his share is double the share of a sister.\n\nd. Full Sister:\n\nIn the absence of above-mentioned residuaries, the full sister is treated as Residuary.\n\nReference Article and Special Thanks to: http://www.shareyouressays.com /knowledge/categories-and-classes-of -legal-heirs-under-the-sunni-muslim-laws /117455"
  }
  