{
    "rules_of_inheritance": "Xeerarka Dhaxalka",
    "rule_1": "Marka Muslimku dhinto, tirada/hantida/gurigu waa la dhaxli karaa ka dib:\n\n1. Bixinta kharashka aaska\n\n2. Soo celinta deymaha\n\n3. Bixinta wixii loo sheegay (oo aan ka badnaan karin 1/3 ee tirada/hantida/guriga)\n\nOgeysiis: Axdiga lama qori karo ka dib marka kuwa dhaxalka sharciga ah ay horey u heleen saamiyo dhaxal ah. Kadib marka la bixiyo kor ku xusan, hantida hadhay waxay u qalantaa dhaxal sida saamiyaasha hoos ku xusan:",
    "husband": "1. Ninkeeda:\n\n(i) Ninku wuxuu helayaa 1/2 haddii aanay caruur/jirrin\n\n(ii) Ninku wuxuu helayaa 1/4 haddii uu caruur/jirro",
    "widow": "2. Carmal:\n\n(1) Carmalka wuxuu helayaa 1/4 haddii aanay caruur/jirrin\n\n(2) Carmalka wuxuu helayaa 1/8 haddii uu caruur/jirro\n\n(3) Haddii uu jiro wax ka badan hal xaas/carmal, dhammaan carmalku waxay si siman u qaybsanayaan 1/4 ama 1/8 saamiga.",
    "father": "3. Aabe (ee marxuumka):\n\n(1) Aabe aan ilmaha lahayn waxaa loola dhaqmaa sidii Residuary i.e. ka dib marka la siiyo saamiyada dhaxalka quraanka wuxuu helayaa hadhaaga.\n\n(2) Haddii ilmaha marxuumku jiro markaas aabuhu wuxuu helayaa 1/6.",
    "mother": "4. Hooyo (ee marxuumka):\n\n(1) Saamiga hooyadu waa 1/3 haddii ay jirin caruur ama laba walaalo ah ama laba walaalo ah ama hal walaal iyo hal walaal.\n\n(3) Haddii hooyadu ay la jirto aabaha iyo xaasaska/carmalka (ama ninka), hooyadu waxay heli doontaa 1/3 wixii hadha ka dib marka laga jaro saamiga lamaane (xaas/xaasaska ama ninka).",
    "daughter": "5. Gabadh:\n\n(1) Saamiga hal gabadh waa 1/2.\n\n(2) Haddii gabdhuhu ka badan yihiin hal i.e. laba ama ka badan, saamiga waa 2/3 oo loo qaybin doonaa si siman iyaga dhexdooda.\n\n(3) Haddii wiilku sidoo kale joogo gabadha. Gabadhu waxay dhaxli doontaa sidii Residuary. Laba qaybood ayaa u tagi doona wiilka iyo hal qayb oo gabadha ah.",
    "full_sister": "6. Walaal buuxa (Walaal ka yimid Hooyo iyo Aabe isku mid ah)\n\n(1) Walaal buuxa kama heli doono saamiga dhaxalka haddii uu jiro:\n\n(a) Caruur, ama\n\n(b) Caruurta wiilka, ama\n\n(c) Aabe, ama\n\n(d) Aabaha aabaha.\n\n(2) Haddii walaashu tahay mid, waxay heli doontaa 1/2.\n\n(3) Haddii walaashu ka badan tahay mid i.e. laba ama ka badan walaalo buuxa, waxay heli doonaan 2/3.\n\n(4) Haddii walaashu jirto walaalka la socdo, waxay dhaxli doontaa sidii Residuary (laba saamiyo ayaa u tagi doona walaalaha(s) iyo hal saami oo walaasha).",
    "law_of_increase": "7. Xeerka Kordhinta (Aul):\n\nKadib marka la qaybiyo dhammaan saamiyada oo wadarta guud ay ka badato mid, waxaa lagu dabaqaa xeerka kordhinta (Aul).\n\nTusaale ahaan, haddii wadarta saamiyada ay tahay 15/12 markaa, 15 waxay matalayaan tirada saamiyada iyo 12 waxay matalayaan jajabyo ama qaybo ka mid ah hantida. Xaaladdan oo kale, saamiyadu waxay dhaafaan tirada jajabka hantida.\n\nWadarta guud waa inay noqotaa mid mid ah, marka labaadna, saamiyada Sharers ma beddeli karaan sababtoo ah waxaa loo qeexay Quraanka. Sidaa darteed, si loo mideeyo iyada oo aan la beddelin saamiyada, jajabka hantida ayaa kordhaya iyadoo la qaadanayo habka soo socda:\n\nHa bedelin qaybiyaha, denominator-ka ayaa la kordhin doonaa si uu u noqdo mid la mid ah numerator-ka (tirada guud ee saamiyada). Habkan, wadarta saamiyada ayaa loo dhigay mid mid ah.\n\nTusaale ahaan, haddii wadar ahaan ay tahay 15/12, waxaan ogaanay in denominator-ka uu yahay 3 ka yar numerator-ka sidaas darteed, adoo ku daraya saddexda denominator-ka (12+3) waxay noqotaa 15 i.e. la mid ah numerator-ka.\n\nTusaale:\n\nMarxuum ayaa dhintay iyada oo ka tagtay ninkeeda (a), iyo (b) laba walaalo buuxa. Saamiyada caadiga ah waa:\n\nNinkeeda 1/2 (Sharer)\n\nLaba walaalo buuxa 2/3 (Sharer)\n\nHalkan, wadarta guud ee saamiyada ma aha mid la mid ah mid, waa (1/2 * 2 / 3) = 7/6 taas oo ka weyn midnimo. Sidaa darteed wadarta saamiyada ninka iyo laba walaalo buuxa ayaa lagu siin karaa sida hoos ku qoran:\n\n3+4\n\n1/2 + 2/3 = z = 7/66\n\nAma, 3/6 + 4/6 = 7/6\n\nSidaa darteed iyadoo la adeegsanayo xeerka kordhinta, hal ayaa lagu daray denominator si ay u noqoto (6+1) = 7. Sidaa darteed, waxaanu kordhinay tirada jajabka hantida iyada oo aan la bedelin saamiyada. Hadda, iyadoo la qaadanayo denominator-ka kordhay (i.e. 7) sidii denominator-ka guud, waxaan ku qaybin karnaa\n\nNinkeeda 3/7\n\nLaba walaalo buuxa 4/7",
    "law_of_return": "8. Xeerka Soo Noqoshada (Radd):\n\nMarka wadarta saamiyada ay ka yar tahay mid, xeerka soo noqoshada (radd) ayaa la isticmaalaa.\n\nMarka wadarta saamiyada ay ka yar tahay mid, waxaa loola jeedaa in tirada saamiyada ay ka yar tahay tirada qaybaha hantida. Tusaale ahaan, wadarta saamiyada oo dhan waa 5/12, macnuhu waa in saamiyadu yihiin 5 halka qaybaha hantidu ay yihiin 12.\n\nHadhayna waxaa lagu daray si waafaqsan habka soo socda:\n\n(1) Wadar ahaan waxay ahayd 5/12, sidaas darteed hadhaaga waa (1 - 5/12) i.e. 7/12. 7/12 waxaa lagu dari doonaa tusaale ahaan si loo qaybiyo aabe iyo walaalo si waafaqsan saamiyadooda i.e. saamiga 1/6 iyo 1/2 siday u kala horreeyaan.\n\n(2) Sharciga Radd kuma dhaqmaan ninka iyo carmalku. Lacagta hadhay waxay ku noqonaysaa dhaxal sugayaasha oo dhan marka laga reebo ninka ama carmalkii. Si kastaba ha ahaatee, haddii carmalku (ama ninku) uu yahay dhaxalka kaliya ee haray waxay dhaxli doonaan dhammaan hantida.\n\nHabka:\n\nSaamiga hadhay ayaa lagu dari doonaa (ka reeb ninka ama carmalkii) si la mid ah saamiyadooda:\n\n(a) Sii dhammaan saamiyada dhaxal sugayaasha.\n\n(b) Haddii lammaanaha (ninka/xaaska) ay jiraan, saamigiisa (ama iyada) waa laga tagi doonaa. Saamiga lama beddeli doono sida waafaqsan xeerka radd.\n\n(c) Ka dib marka laga jaro saamiga lammaanaha. Tusaale ahaan, haddii gabadha iyo hooyadu ay ka tagaan, saamiyadoodu waa 1/6 iyo 1/2 siday u kala horreeyaan. Saamiga waa 3:1, haddii hantida ay tahay 4, saamiga gabadha waa 3/4, saamiga hooyaduna waa 1/4.\n\n(e) Tusaale ahaan, ka dib marka la jaro saamiga carmalkii (1/8) hadhaaga waa (1-1/8) = 7/8. Hadhayna waxaa loo qaybin doonaa inta u dhaxaysa gabadha iyo hooyada saamiga ah 3:1. Saamiyada gabadha iyo hooyada waxay noqon doontaa 3/4 ee 7/8 iyo 1/4 ee 7/8 siday u kala horreeyaan.\n\nTusaale:\n\nMarxuumkii wuxuu ka tegay (a) ninkeeda iyo (b) hooyadeed. Hantidu waxay noqon doontaa dhaxal sidan:\n\nNinkeeda 1/2 (Sharer)\n\nHooyadeed 1/3 (Sharer)\n\nWadarta saamiyada waa 1/2 + 1/3 = 5/6, halkaasoo, hantida la qaybiyo waa mid. Hadhayna waa (1-5/6) i.e. 1/6. Hadhayna waxay ku noqon doontaa dhaxal sugayaasha.\n\nLaakiin, lamaane ma heli doonto hadhaaga. Xaaladdan oo kale, hooyadu waxay heli doontaa hantida/lacagta hadhay. Sidaa darteed, saamiga hooyadu waa 1/3 + 1/6 = 1/2.\n\nNinkeeda 1/2 (Sharer)\n\nHooyadeed 1/2 (1/3 as Sharer + 1/6 in return)",
    "residuaries": "9. Residuaries:\n\nMarka marxuumku aanu lahayn sharers, hantida waxaa dhaxli doona Residuaries. Marka labaad, ka dib marka la qaybiyo hantida, hadhaaga hadha iyo hadhaaga ayaa jiro, hadhaaga wuxuu u gudbi doonaa Residuaries.\n\nQaar ka mid ah sharers-ku waxay noqon doonaan Residuaries tusaale ahaan, gabadha oo leh wiil, walaal iyo walaal oo wada socda. Aabaha aan ilmaha lahayn (ee propositus) wuxuu noqon doonaa Residuary.\n\nLiiska Residuaries waa sida hoos ku qoran:\n\nDabadeed:\n\na. Wiil:\n\n(i) marka gabadhu jirto wiilku wuxuu qaataa hadhaaga oo dhan.\n\n(ii) marka wiilka iyo gabadha labaduba ay jiraan, wiilku wuxuu helayaa laba laab saamiga gabadha.\n\nAscendants:\n\nb. Aabe:\n\nHadhaaga oo dhan wuxuu aadi doonaa aabaha.\n\nLaamaha: Faracyada Aabaha:\n\nc. Walaal buuxa:\n\n(i) Haddii walaashu aysan jirin, walaal buuxa wuxuu dhaxlaa hadhaaga oo dhan.\n\n(ii) Haddii walaashu ay jirto walaalka la socda, walaal buuxa wuxuu la dhaxlaa iyada laakiin saamigiisa waa labanlaab saamiga walaasha.\n\nd. Walaal buuxa:\n\nHaddii aysan jirin Residuaries-ka kor ku xusan, walaal buuxa waxaa loola dhaqmaa sidii Residuary.\n\nTixraaca Qoraalka iyo Mahadcelinta Gaarka ah: http://www.shareyouressays.com /knowledge/categories-and-classes-of -legal-heirs-under-the-sunni-muslim-laws /117455"
  }
  